app/controllers/bodyweights_controller.rb

SELECT "bodyweights".* FROM "bodyweights" WHERE "bodyweights"."prep_id" = $1 ORDER BY "bodyweights"."created_at" DESC  [["prep_id", 2]]
---
  def index
    @weights = @prep.bodyweights.order(created_at: :asc)

INSERT INTO "bodyweights" ("weight", "prep_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["weight", 2000], ["prep_id", 2], ["created_at", 2016-05-02 20:25:40 UTC], ["updated_at", 2016-05-02 20:25:40 UTC]]
---
  def create
    @weight = Bodyweight.new(weight_params)
    @weight.prep = @prep
    if @weight.save!