app/controllers/preps_controller.rb

  def index
    @preps = Prep.all
---
SELECT "preps".* FROM "preps"

  def create
    @prep = Prep.new(prep_params)
    if @prep.save
---
INSERT INTO "preps" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Spring 2016"], ["created_at", 2016-05-02 19:17:52 UTC], ["updated_at", 2016-05-02 19:17:52 UTC]]